# customer-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=1sv926z3fc]
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/customer_api]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.lambda_role: Refreshing state... [id=lambda-execution-customer_api]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=7b5d6c4f-8a7c-4fc6-800e-a2fe8feab939:customer_api]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer_api-20230517051049745000000001]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/customer_api]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 0s [id=production]
module.common_resources.data.curl.cognito_user_pool_keys: Reading...
module.common_resources.data.curl.cognito_user_pool_keys: Read complete after 0s [id=1684930980]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-450d6976-4808-49d5-a408-04cc68a55ebc]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-3aaef659-0f9f-4ab3-8c97-1bb7e0ee9ec9]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 1s [id=96d5a2796634eb2082f1211d117326219c7b4598]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=customer_api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=63joby6]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any["all"]: Refreshing state... [id=z7xci6s]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "customer_api"
      ~ last_modified                  = "2023-05-24T08:22:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "712CYDKojdtO5mUwgDrcJXeKMrglU9Ul7kDXa28eDmc=" -> "tv+xMD/B6feRwNHQa5y6zkobUeR2aMAIK6CkLdk5Tho="
        tags                           = {
            "domain"        = "customer"
            "environment"   = "production"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS"               = "fast-anteater-6016-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"                     = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"                      = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"                        = "677ab0ecb97b47f885d236ad095d2dce"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"                  = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"                        = "ZmFzdC1hbnRlYXRlci02MDE2JIMxGX-WLd9KubI1dJqBcDG6YO8ZpXdOzsH8K50"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"                     = (sensitive value)
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_DEFAULT_KEYS" = jsonencode(
                    {
                      - keys = [
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "RBY03lYaejrzL0ICwUwW875p4Je8sLKVDCnHAotVFvc="
                              - kty = "RSA"
                              - n   = "k94QlnGSLlWG4nag68mVgblajNEqZV2Y2amIFqrZ3x2nDu9Pv1duGT24TnJ7_vJmxDLv5e-tYal9nt9hJsM74GPAYMjZOL93asuNc7x90W8KpLpELojc8wNB0wkBJFpbxmbm0V5eqIdJnqmJeDeK1EcyeZuwsIB6ogMAEMmCIglrhgHTIcemeQDRZHOMbWPvFsDFJDVTH2hniJQ275WJ-8FwRRlIefXUyd-TC31zE2qw4tftGL9v60w01fx-3POhulXunMm1yapjxLMgYezJH408_W0wfqprR78itZcryNZ6WK84hyaFJg_E15YU41dsFHeemqvcTLvhTt6BLfNlzQ"
                              - use = "sig"
                            },
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "RIVK8Yz0Ios5LhpSpFwOrVWQ1Rx56I/RDviI+WslnRo="
                              - kty = "RSA"
                              - n   = "-Z58duYaMXI6w58_TbCegc_ILTvDmrgSo6hEPX1zv_0UDP8ezKXtix6M6xkLT0vrzTwosodM8H9guvpMtf9GPlodzSE4v3_B94X3jLaPQ_R72CCnmO39kHUhzx6k1nEw9fwR1tjVEvUwExhiHHeuapHyv13cN8Iqx7z66VnpAQ5ng8PZxc3Wmlw9F0Zl9cFV-3qYHa2nrKrKAA5s0RB0To2HTKE94qzJXHWB0BOnliJxH7KWgDEl1c92ljVAG5m2sPGk5CgSyawZc9DO9bS-_nt120il-GijPXNIGmWOv8j-ClgXhMuaWjHWh-FMEQxV_zkpCTndP1zwZ-gPwBmmww"
                              - use = "sig"
                            },
                        ]
                    }
                )
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_URL"          = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_gl21W78mM/.well-known/jwks.json"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "7b5d6c4f-8a7c-4fc6-800e-a2fe8feab939:customer_api"
        name       = "customer_api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "ed7db37d-7f6d-4ba5-9cd1-5d4fec59b370" -> "0a5f2fd0-525a-4f7f-a3cd-c0e934cc23c1"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*